In [1]:
from pyspark.sql import SparkSession

In [2]:
spark=SparkSession.builder.appName('joins').getOrCreate()

In [3]:
spark

In [7]:
d1=[('I1', "Alice", "HR"),('I2', "Bob", "Engineering"),('I3', "Charlie", "Marketing"),('I4', "David", "Engineering")]

In [8]:
col1 = ["emp_id", "name", "department"]

df1 = spark.createDataFrame(d1, col1)
df1.show()

+------+-------+-----------+
|emp_id|   name| department|
+------+-------+-----------+
|    I1|  Alice|         HR|
|    I2|    Bob|Engineering|
|    I3|Charlie|  Marketing|
|    I4|  David|Engineering|
+------+-------+-----------+

In [9]:
df1.printSchema()

root
 |-- emp_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- department: string (nullable = true)

In [15]:
data2 = [('I1', 1000.0),('I2', 1500.0),('I3', 1200.0),('I5', 1800.0)]

col2 = ["emp_id", "salary"]

df2 = spark.createDataFrame(data2, col2)
df2.show()
df2.printSchema()

+------+------+
|emp_id|salary|
+------+------+
|    I1|1000.0|
|    I2|1500.0|
|    I3|1200.0|
|    I5|1800.0|
+------+------+

root
 |-- emp_id: string (nullable = true)
 |-- salary: double (nullable = true)

In [17]:
#inner join
df1.join(df2,on='emp_id',how='inner').show()

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
+------+-------+-----------+------+

In [18]:
#left join
df1.join(df2,on='emp_id',how='left').show()

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
|    I4|  David|Engineering|  NULL|
+------+-------+-----------+------+

In [27]:
#right join and condition when column names are different
df1.join(df2,df1.emp_id==df2.emp_id,how='right').show()

+------+-------+-----------+------+------+
|emp_id|   name| department|emp_id|salary|
+------+-------+-----------+------+------+
|    I1|  Alice|         HR|    I1|1000.0|
|    I2|    Bob|Engineering|    I2|1500.0|
|    I3|Charlie|  Marketing|    I3|1200.0|
|  NULL|   NULL|       NULL|    I5|1800.0|
+------+-------+-----------+------+------+

In [24]:
df1.join(df2).show()

+------+-------+-----------+------+------+
|emp_id|   name| department|emp_id|salary|
+------+-------+-----------+------+------+
|    I1|  Alice|         HR|    I1|1000.0|
|    I1|  Alice|         HR|    I2|1500.0|
|    I1|  Alice|         HR|    I3|1200.0|
|    I1|  Alice|         HR|    I5|1800.0|
|    I2|    Bob|Engineering|    I1|1000.0|
|    I2|    Bob|Engineering|    I2|1500.0|
|    I2|    Bob|Engineering|    I3|1200.0|
|    I2|    Bob|Engineering|    I5|1800.0|
|    I3|Charlie|  Marketing|    I1|1000.0|
|    I3|Charlie|  Marketing|    I2|1500.0|
|    I3|Charlie|  Marketing|    I3|1200.0|
|    I3|Charlie|  Marketing|    I5|1800.0|
|    I4|  David|Engineering|    I1|1000.0|
|    I4|  David|Engineering|    I2|1500.0|
|    I4|  David|Engineering|    I3|1200.0|
|    I4|  David|Engineering|    I5|1800.0|
+------+-------+-----------+------+------+

In [29]:
#full/outer join
df1.join(df2,on='emp_id',how='outer').show()
df1.join(df2,on='emp_id',how='fullouter').show()
df1.join(df2,on='emp_id',how='full_outer').show()
df1.join(df2,on='emp_id',how='full').show()

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
|    I4|  David|Engineering|  NULL|
|    I5|   NULL|       NULL|1800.0|
+------+-------+-----------+------+

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
|    I4|  David|Engineering|  NULL|
|    I5|   NULL|       NULL|1800.0|
+------+-------+-----------+------+

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
|    I4|  David|Engineering|  NULL|
|    I5|   NULL|       NULL|1800.0|
+------+-------+-----------+------+

+------+-------+-----------+------+
|emp_id|   name| department|salary|
+------+-------+-----------+------+
|    I1|  Alice|         HR|1000.0|
|    I2|    Bob|Engineering|1500.0|
|    I3|Charlie|  Marketing|1200.0|
|    I4|  David|Engineering|  NULL|
|    I5|   NULL|       NULL|1800.0|
+------+-------+-----------+------+

In [31]:
#leftsemi
df1.join(df2,on='emp_id',how='leftsemi').show()
df1.join(df2,on='emp_id',how='semi').show()

+------+-------+-----------+
|emp_id|   name| department|
+------+-------+-----------+
|    I1|  Alice|         HR|
|    I2|    Bob|Engineering|
|    I3|Charlie|  Marketing|
+------+-------+-----------+

+------+-------+-----------+
|emp_id|   name| department|
+------+-------+-----------+
|    I1|  Alice|         HR|
|    I2|    Bob|Engineering|
|    I3|Charlie|  Marketing|
+------+-------+-----------+

In [32]:
#leftanti
df1.join(df2,on='emp_id',how='leftanti').show()

+------+-----+-----------+
|emp_id| name| department|
+------+-----+-----------+
|    I4|David|Engineering|
+------+-----+-----------+

In [44]:
#retrieving employee name along with their manager
from pyspark.sql.functions import col
d=[(1, "Ravi", 0), (2, "Tharun", 1),(3, "Sudheer", 1),(4, "David", 2)]
colm=['empid','Name','manag_id']
df=spark.createDataFrame(d,colm)
df.show()
emp=df.alias('emp')
manag=df.alias('manag')
emp.join(manag,col('emp.manag_id')==col('manag.empid'),'inner')\
.select(col('emp.Name').alias('employee'),col('manag.Name').alias('manager')).show()

+-----+-------+--------+
|empid|   Name|manag_id|
+-----+-------+--------+
|    1|   Ravi|       0|
|    2| Tharun|       1|
|    3|Sudheer|       1|
|    4|  David|       2|
+-----+-------+--------+

+--------+-------+
|employee|manager|
+--------+-------+
|  Tharun|   Ravi|
| Sudheer|   Ravi|
|   David| Tharun|
+--------+-------+

In [22]:
help(df1.join)

Help on method join in module pyspark.sql.dataframe:

join(other: 'DataFrame', on: Union[str, List[str], pyspark.sql.column.Column, List[pyspark.sql.column.Column], NoneType] = None, how: Optional[str] = None) -> 'DataFrame' method of pyspark.sql.dataframe.DataFrame instance
    Joins with another :class:`DataFrame`, using the given join expression.

    .. versionadded:: 1.3.0

    .. versionchanged:: 3.4.0
        Supports Spark Connect.

    Parameters
    ----------
    other : :class:`DataFrame`
        Right side of the join
    on : str, list or :class:`Column`, optional
        a string for the join column name, a list of column names,
        a join expression (Column), or a list of Columns.
        If `on` is a string or a list of strings indicating the name of the join column(s),
        the column(s) must exist on both sides, and this performs an equi-join.
    how : str, optional
        default ``inner``. Must be one of: ``inner``, ``cross``, ``outer``,
        ``full``, ``fullouter``, ``full_outer``, ``left``, ``leftouter``, ``left_outer``,
        ``right``, ``rightouter``, ``right_outer``, ``semi``, ``leftsemi``, ``left_semi``,
        ``anti``, ``leftanti`` and ``left_anti``.

    Returns
    -------
    :class:`DataFrame`
        Joined DataFrame.

    Examples
    --------
    The following performs a full outer join between ``df1`` and ``df2``.

    >>> from pyspark.sql import Row
    >>> from pyspark.sql.functions import desc
    >>> df = spark.createDataFrame([(2, "Alice"), (5, "Bob")]).toDF("age", "name")
    >>> df2 = spark.createDataFrame([Row(height=80, name="Tom"), Row(height=85, name="Bob")])
    >>> df3 = spark.createDataFrame([Row(age=2, name="Alice"), Row(age=5, name="Bob")])
    >>> df4 = spark.createDataFrame([
    ...     Row(age=10, height=80, name="Alice"),
    ...     Row(age=5, height=None, name="Bob"),
    ...     Row(age=None, height=None, name="Tom"),
    ...     Row(age=None, height=None, name=None),
    ... ])

    Inner join on columns (default)

    >>> df.join(df2, 'name').select(df.name, df2.height).show()
    +----+------+
    |name|height|
    +----+------+
    | Bob|    85|
    +----+------+
    >>> df.join(df4, ['name', 'age']).select(df.name, df.age).show()
    +----+---+
    |name|age|
    +----+---+
    | Bob|  5|
    +----+---+

    Outer join for both DataFrames on the 'name' column.

    >>> df.join(df2, df.name == df2.name, 'outer').select(
    ...     df.name, df2.height).sort(desc("name")).show()
    +-----+------+
    | name|height|
    +-----+------+
    |  Bob|    85|
    |Alice|  NULL|
    | NULL|    80|
    +-----+------+
    >>> df.join(df2, 'name', 'outer').select('name', 'height').sort(desc("name")).show()
    +-----+------+
    | name|height|
    +-----+------+
    |  Tom|    80|
    |  Bob|    85|
    |Alice|  NULL|
    +-----+------+

    Outer join for both DataFrams with multiple columns.

    >>> df.join(
    ...     df3,
    ...     [df.name == df3.name, df.age == df3.age],
    ...     'outer'
    ... ).select(df.name, df3.age).show()
    +-----+---+
    | name|age|
    +-----+---+
    |Alice|  2|
    |  Bob|  5|
    +-----+---+

Pivot & Unpivot Table

In [58]:
data=[('I1', "Arul","Female","HR"),('I2', "Boby","Male", "Engineering"),('I3', "Charlie","Male","Marketing"),('I6', "dwen","Female", "IT"),
      ('I4', "della","Male", "Engineering"),('I5', "Drona","Male", "HR"),('I7', "Jenny","Female", "Engineering"),('I2', "Dharma","Male", "IT")]
col1 = ["emp_id", "Name","Gender", "Department"]

df_p = spark.createDataFrame(data, col1)
df_p.show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
|    I2| Dharma|  Male|         IT|
+------+-------+------+-----------+

In [60]:
import pyspark.sql.functions as F
df_p.groupBy('Department','Gender').count().show()

+-----------+------+-----+
| Department|Gender|count|
+-----------+------+-----+
|Engineering|  Male|    2|
|         HR|Female|    1|
|         IT|Female|    1|
|  Marketing|  Male|    1|
|         HR|  Male|    1|
|Engineering|Female|    1|
|         IT|  Male|    1|
+-----------+------+-----+

In [63]:
df_up=df_p.groupBy('Department').pivot('Gender').count()
df_up.show()

+-----------+------+----+
| Department|Female|Male|
+-----------+------+----+
|Engineering|     1|   2|
|         HR|     1|   1|
|  Marketing|  NULL|   1|
|         IT|     1|   1|
+-----------+------+----+

In [61]:
df_p.groupBy('Gender').pivot('Department').count().show()

+------+-----------+---+---+---------+
|Gender|Engineering| HR| IT|Marketing|
+------+-----------+---+---+---------+
|Female|          1|  1|  1|     NULL|
|  Male|          2|  1|  1|        1|
+------+-----------+---+---+---------+

#unpivot

In [64]:
df_up.show()

+-----------+------+----+
| Department|Female|Male|
+-----------+------+----+
|Engineering|     1|   2|
|         HR|     1|   1|
|  Marketing|  NULL|   1|
|         IT|     1|   1|
+-----------+------+----+

In [65]:
df_up.select('Department',F.expr("stack(2,'Female',female,'Male',male) as (Gender,count)")).show()

+-----------+------+-----+
| Department|Gender|count|
+-----------+------+-----+
|Engineering|Female|    1|
|Engineering|  Male|    2|
|         HR|Female|    1|
|         HR|  Male|    1|
|  Marketing|Female| NULL|
|  Marketing|  Male|    1|
|         IT|Female|    1|
|         IT|  Male|    1|
+-----------+------+-----+

#union functions

In [70]:
data=[('I1', "Arul","Female","HR"),('I2', "Boby","Male", "Engineering"),('I3', "Charlie","Male","Marketing"),('I6', "dwen","Female", "IT"),
      ('I4', "della","Male", "Engineering")]
data2=[('I5', "Drona","Male", "HR"),('I7', "Jenny","Female", "Engineering"),('I2', "Boby","Male", "Engineering")]
col1 = ["emp_id", "Name","Gender", "Department"]

df_1 = spark.createDataFrame(data, col1)
df_2 = spark.createDataFrame(data2, col1)
df_1.show()
df_2.show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
+------+-------+------+-----------+

+------+-----+------+-----------+
|emp_id| Name|Gender| Department|
+------+-----+------+-----------+
|    I5|Drona|  Male|         HR|
|    I7|Jenny|Female|Engineering|
|    I2| Boby|  Male|Engineering|
+------+-----+------+-----------+

In [76]:
#using union to combine two df
df_1.union(df_2).show()
df_1.union(df_2).drop_duplicates().show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
|    I2|   Boby|  Male|Engineering|
+------+-------+------+-----------+

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
+------+-------+------+-----------+

In [77]:
#using unionAll to combine two df
df_1.unionAll(df_2).show()
df_1.unionAll(df_2).distinct().show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
|    I2|   Boby|  Male|Engineering|
+------+-------+------+-----------+

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
+------+-------+------+-----------+

unionByName

In [78]:

df_1.unionByName(df_2).show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|    I5|  Drona|  Male|         HR|
|    I7|  Jenny|Female|Engineering|
|    I2|   Boby|  Male|Engineering|
+------+-------+------+-----------+

In [84]:
df_3=spark.createDataFrame([(1, "Aarav", "Male"),(2, "Ishita", "Female"),(3, "Aditya", "Male")],["emp_id", "name", "gender"])

In [85]:
df_1.printSchema()
df_3.printSchema()

root
 |-- emp_id: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Department: string (nullable = true)

root
 |-- emp_id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)

In [90]:
df_1.unionByName(df_3,allowMissingColumns=True).show()

+------+-------+------+-----------+
|emp_id|   Name|Gender| Department|
+------+-------+------+-----------+
|    I1|   Arul|Female|         HR|
|    I2|   Boby|  Male|Engineering|
|    I3|Charlie|  Male|  Marketing|
|    I6|   dwen|Female|         IT|
|    I4|  della|  Male|Engineering|
|     1|  Aarav|  Male|       NULL|
|     2| Ishita|Female|       NULL|
|     3| Aditya|  Male|       NULL|
+------+-------+------+-----------+

Combining Columns

In [95]:
df_1.select(F.concat(df_1['emp_id'],df_1['Department'])).show()

+--------------------------+
|concat(emp_id, Department)|
+--------------------------+
|                      I1HR|
|             I2Engineering|
|               I3Marketing|
|                      I6IT|
|             I4Engineering|
+--------------------------+

Activity

In [115]:
# Read JSON file
d1 = spark.read.option("multiLine", "true").format("json").load("C:/Users/acer/projects/employees.json")
d1.show()
d2 = spark.read.option("multiLine", "true").format("json").load("C:/Users/acer/projects/department.json")
d2.show()
d3 = spark.read.option("multiLine", "true").format("json").load("C:/Users/acer/projects/projects.json")
d3.show()

+------------+----------+-------+------+
|DepartmentID|EmployeeID|   Name|Salary|
+------------+----------+-------+------+
|         101|         1|  Alice| 80000|
|         102|         2|    Bob| 75000|
|         101|         3|Charlie| 90000|
|         103|         4|  David| 60000|
|        NULL|         5|    Eve| 70000|
+------------+----------+-------+------+

+------------+--------------+
|DepartmentID|DepartmentName|
+------------+--------------+
|         101|            HR|
|         102|            IT|
|         103|       Finance|
+------------+--------------+

+----------+---------+---------------+
|EmployeeID|ProjectID|    ProjectName|
+----------+---------+---------------+
|         1|       P1|    Recruitment|
|         2|       P2|Website Upgrade|
|         4|       P3|Budget Analysis|
|      NULL|       P4| Internal Audit|
+----------+---------+---------------+

In [123]:
#retrieve all employees with their department names(also those who do not have a department)
emp_dep=d1.join(d2,on='DepartmentID',how='left')
emp_dep.show()

+------------+----------+-------+------+--------------+
|DepartmentID|EmployeeID|   Name|Salary|DepartmentName|
+------------+----------+-------+------+--------------+
|         101|         1|  Alice| 80000|            HR|
|         102|         2|    Bob| 75000|            IT|
|         101|         3|Charlie| 90000|            HR|
|         103|         4|  David| 60000|       Finance|
|        NULL|         5|    Eve| 70000|          NULL|
+------------+----------+-------+------+--------------+

In [124]:
#total salary spent per department.
emp_dep.groupBy().pivot("DepartmentName").sum("Salary").show()

+-----+-------+------+-----+
| null|Finance|    HR|   IT|
+-----+-------+------+-----+
|70000|  60000|170000|75000|
+-----+-------+------+-----+

In [125]:
#All department names and their respective employee names.
emp_dep.select('Name','DepartmentName').show()

+-------+--------------+
|   Name|DepartmentName|
+-------+--------------+
|  Alice|            HR|
|    Bob|            IT|
|Charlie|            HR|
|  David|       Finance|
|    Eve|          NULL|
+-------+--------------+

In [126]:
#project names and the names of employees working on them.
proj_emp=d3.join(d1,on='EmployeeID',how='left')
proj_emp.select('ProjectName','Name').show()

+---------------+-----+
|    ProjectName| Name|
+---------------+-----+
|    Recruitment|Alice|
|Website Upgrade|  Bob|
|Budget Analysis|David|
| Internal Audit| NULL|
+---------------+-----+

In [137]:
num_emp=d1.groupBy('DepartmentID').count()
num_proj=proj_emp.groupBy('DepartmentID').count()

In [139]:
#total number of employees and the total number of projects ,each department is handling
d2.join(num_emp,on='DepartmentID',how='left').withColumnRenamed('count','employees').join(num_proj,on='DepartmentID',how='left').withColumnRenamed('count','projects').show()

+------------+--------------+---------+--------+
|DepartmentID|DepartmentName|employees|projects|
+------------+--------------+---------+--------+
|         101|            HR|        2|       1|
|         102|            IT|        1|       1|
|         103|       Finance|        1|       1|
+------------+--------------+---------+--------+